src/AccumulationRegisters/РегистрОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/РегистрОстатки/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ВыполнитьКонтрольРезультатовПроведения(ДокументОбъект, Отказ) Экспорт
	МетаРегистр = ЭтотОбъект.ДополнительныеСвойства.Метаданные;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = ЭтотОбъект.ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрОстаткиОстатки.Организация КАК Организация,
	|	РегистрОстаткиОстатки.Пользователь КАК Пользователь,
	|	РегистрОстаткиОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.РегистрОстатки.Остатки(
	|			,
	|			(Организация, Пользователь) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Т.Организация,
	|					Т.Пользователь
	|				ИЗ
	|					РегистрОстаткиИзменение КАК Т)) КАК РегистрОстаткиОстатки
	|ГДЕ
	|	РегистрОстаткиОстатки.КоличествоОстаток < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РегистрОстаткиИзменение";
	
	ДокументОбъект.ДополнительныеСвойства.РезультатКонтроля.Вставить(МетаРегистр.Имя, Запрос.Выполнить().Выгрузить());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийМодуля

Процедура ПередЗаписью(Отказ, Замещение)
	
	ПроведениеСерверПТБ.ПередЗаписьюРегистра(ЭтотОбъект, Отказ, Замещение);

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ЭтотОбъект.ОбменДанными.Загрузка ИЛИ НЕ ПроведениеСерверПТБ.РассчитыватьИзменения(ЭтотОбъект.ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	ПравилаПроверки = Новый Массив;
	ПравилаПроверки.Добавить("СУММА(ТаблицаДвижений.Количество) < 0");
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ПравилаПроверкиРесурсов", ПравилаПроверки);
	
	ПроведениеСерверПТБ.ПриЗаписиРегистра(ЭтотОбъект, Отказ, Замещение);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
